/* 
 * Copyright 2009 High Order Bit, Inc.. All rights reserved.
 */

/*
 * General purpose strings.
 */

/* Used to provide a common localized format for NSDate objects. Format string
 * is based on the Unicode standard:
 *    http://unicode.org/reports/tr35/tr35-6.html#Date_Format_Patterns
 */
/*"date.format.localized" = "EEE, MMM d, yyyy HH:mm:ss zzz";*/
"date.format.localized" = "EEE M/d/yy HH:MM:ss a 'GMT'";

/*
 * Strings for the project details view.
 */

"servergroups.all.label" = "All";

"projectdetails.view.title" = "Info";
"projectdetails.buildstatus.label" = "status";
"projectdetails.buildstatus.succeeded.label" = "Succeeded";
"projectdetails.buildstatus.failed.label" = "Failed";
"projectdetails.builddate.label" = "date";
"projectdetails.buildlabel.label" = "build";
"projectdetails.builddetails.label" = "Build Details";
"projectdetails.forcebuild.label" = "Force Build";
"projectdetails.forcebuild.started.label" = "Forcing build";
"projectdetails.forcebuild.finished.label" = "Build forced";
"projectdetails.emailreport.label" = "Email Report";
"projectdetails.visitwebsite.label" = "Open in Safari";

/*
 * Used in the add server view.
 */

"addserver.view.title" = "Add Server";
"addserver.view.prompt" = "Enter your CruiseControl dashboard's RSS feed";
"addserver.nav.connect.title" = "Connect";
"addserver.url.placeholder" = "Server URL";
"addserver.connecting.prompt" = "Connecting to server...";
"addserver.error.alert.title" = "Cannot Connect to Server";
"addserver.error.alert.ok" = "OK";

"ccserver.unrecognized.formatstring" = "Unrecognized XML returned from URL: \"%@\"";
"ccserver.description.notprovided.message" = "Not provided by the CruiseControl server.";
"ccserver.dashboardlink.notprovided.message" = "not provided";
"ccserver.unsupported.message" = "Unsupported server.";

"ccnet.serverreport.name" = "My CruiseControl.NET Server";
"ccjava.serverreport.name" = "My CruiseControl Server";

/*
 * Used in the edit server details view.
 */

"editserverdetails.view.title" = "Edit Info";
"editserverdetails.servername.placeholder" = "Server name";
"editserverdetails.link.label" = "feed";
"editserverdetails.dashboardlink.label" = "dashboard";
"editserverdetails.numprojects.label" = "projects";

/*
 * Forcing a build.
 */
 
"forcebuild.failed.title" = "Force Build Failed";
"forcebuild.failed.message.formatstring" = "%@\n%@";
"forcebuild.failed.ok" = "OK";

/*
 * Used in the build details view.
 */
"builddetails.title.formatstring" = "%@ build %@";  

/*
 * Used when refreshing the build status of servers.
 */

"server.refresh.failed.title.singular" = "Failed to update %d server";
"server.refresh.failed.title.plural" = "Failed to update %d servers";
"server.refresh.failed.ok" = "Dismiss";
"server.refresh.failed.details" = "Details";
"server.refresh.failed.next" = "Next";

"xml.parse.failed" = "Failed to parse XML data.";